       >> SOURCE FORMAT FREE
ID DIVISION.
       PROGRAM-ID. coboltut3.
       AUTHOR. Greg.
       DATE-WRITTEN. OCTOBER 13, 2024.

ENVIRONMENT DIVISION.

DATA DIVISION.
    FILE SECTION.
    WORKING-STORAGE SECTION.

PROCEDURE DIVISION.

STOP RUN.
